       fd  kunde-file.
       01  kunde-record.
           05  kunde-id          pic x(11).
           05  kunde-navn        pic x(20).
           05  kunde-foedselsdato pic x(10).
           05  kunde-adresse     pic x(30).
           05  kunde-land        pic x(2).
