       fd  sanction-file.
       01  sanction-record.
           05  sanction-id             pic x(5).
           05  sanction-navn           pic x(20).
           05  sanction-alias-1        pic x(20).
           05  sanction-alias-2        pic x(20).
           05  sanction-alias-3        pic x(20).
           05  sanction-alias-4        pic x(20).
           05  sanction-alias-5        pic x(20).
           05  sanction-foedselsdato   pic x(10).
           05  sanction-land           pic x(2).
