       05 B-REG-NR         PIC X(4).
       05 B-BANKNAVN       PIC X(30).
       05 B-BANKADRESSE    PIC X(50).
       05 B-TELEFON        PIC X(15).
       05 B-EMAIL          PIC X(30).        
       