       02 customer-id-ac PIC X(10).
       02 account-id PIC X(10).
       02 account-type PIC X(20).
       02 balance-ac PIC ZZZZZZ9V99.
       02 currency-id PIC X(3).
       