       05 T-CPR            PIC X(15).
       05 T-NAVN           PIC N(30).
       05 T-ADRESSE        PIC X(50).
       05 T-FOEDSELSDATO   PIC X(10).
       05 T-KONTO-ID       PIC X(15).
       05 T-REG-NR         PIC X(4).
       05 T-BELOEB         PIC S9(9)V99. *> Signed, 9 integer, 2 decimal
       05 T-VALUTA         PIC X(3).
       05 T-TRANSACTIONSTYPE PIC X(15).
       05 T-BUTIK          PIC X(20).
       05 T-TIDSPUNKT      PIC X(26).