       05 T-CPR            PIC X(15).
       05 T-NAVN           PIC X(30).
       05 T-ADRESSE        PIC X(50).
       05 T-FOEDSELSDATO   PIC X(11).
       05 T-KONTO-ID       PIC X(14).
       05 T-REG-NR         PIC X(6).
       05 T-BELOEB         PIC S9(13)V99. *> Signed, 9 integer, 2 decimal
       05 T-VALUTA         PIC X(4).
       05 T-TRANSACTIONSTYPE PIC X(20).
       05 T-BUTIK          PIC X(20).
       05 T-TIDSPUNKT      PIC X(26).
